In [1]:
import pandas as pd
spending_df = pd.DataFrame({
    '生活費':[8000, 7000],
    '娛樂費':[3000, 5000],
    '交通費':[1000, 1200]

 })
spending_df.head()

    生活費   娛樂費   交通費
0  8000  3000  1000
1  7000  5000  1200

In [2]:
#新增一欄
spending_df['住宿費'] = [8000, 8000]
spending_df

    生活費   娛樂費   交通費   住宿費
0  8000  3000  1000  8000
1  7000  5000  1200  8000

In [3]:
#新增一列，如該列有資料則直接取代該列
spending_df.loc[2]=[7500, 4000, 1200, 8000]
spending_df

    生活費   娛樂費   交通費   住宿費
0  8000  3000  1000  8000
1  7000  5000  1200  8000
2  7500  4000  1200  8000

In [4]:
#改變df欄名稱(axis = 1)
rename_attribute = {'生活費':'110年生活費','娛樂費':'110年娛樂費','交通費':'110年交通費','住宿費':'110年住宿費'}
spending_df = spending_df.rename(rename_attribute, axis=1)
spending_df

   110年生活費  110年娛樂費  110年交通費  110年住宿費
0     8000     3000     1000     8000
1     7000     5000     1200     8000
2     7500     4000     1200     8000

In [5]:
#改變df列index(axis = 0)
rename_index = {0:'一月',1:'二月',2:'三月'}
spending_df = spending_df.rename(rename_index, axis=0)
spending_df

    110年生活費  110年娛樂費  110年交通費  110年住宿費
一月     8000     3000     1000     8000
二月     7000     5000     1200     8000
三月     7500     4000     1200     8000

In [6]:
#儲存成csv檔
spending_df.to_csv('spending_df.csv')

In [7]:
#讀檔
spending_df = pd.read_csv('spending_df.csv')
spending_df

  Unnamed: 0  110年生活費  110年娛樂費  110年交通費  110年住宿費
0         一月     8000     3000     1000     8000
1         二月     7000     5000     1200     8000
2         三月     7500     4000     1200     8000

In [8]:
#讀檔，使第一欄成為index
spending_df = pd.read_csv('spending_df.csv',index_col=0)
spending_df

    110年生活費  110年娛樂費  110年交通費  110年住宿費
一月     8000     3000     1000     8000
二月     7000     5000     1200     8000
三月     7500     4000     1200     8000

In [6]:
spending_df_tmp = spending_df

In [7]:
#刪除df欄資料(axis = 1)
columns_drop = ['110年交通費', '110年住宿費']
spending_df = spending_df.drop(columns_drop, axis=1)
spending_df

    110年生活費  110年娛樂費
一月     8000     3000
二月     7000     5000
三月     7500     4000

In [8]:
#刪除列資料(axis = 0)
rows_drop = ['二月', '三月']
spending_df = spending_df.drop(rows_drop, axis=0)
spending_df

    110年生活費  110年娛樂費
一月     8000     3000

In [9]:
spending_df = spending_df_tmp
spending_df

    110年生活費  110年娛樂費  110年交通費  110年住宿費
一月     8000     3000     1000     8000
二月     7000     5000     1200     8000
三月     7500     4000     1200     8000

In [10]:
#重置列索引
#方法一
spending_df = spending_df.reset_index()#inplace=False
spending_df

  index  110年生活費  110年娛樂費  110年交通費  110年住宿費
0    一月     8000     3000     1000     8000
1    二月     7000     5000     1200     8000
2    三月     7500     4000     1200     8000

In [11]:
spending_df = spending_df_tmp
spending_df

    110年生活費  110年娛樂費  110年交通費  110年住宿費
一月     8000     3000     1000     8000
二月     7000     5000     1200     8000
三月     7500     4000     1200     8000

In [12]:
#重置列索引
#方法二
spending_df = spending_df.reset_index(drop=True)
spending_df

   110年生活費  110年娛樂費  110年交通費  110年住宿費
0     8000     3000     1000     8000
1     7000     5000     1200     8000
2     7500     4000     1200     8000

In [13]:
spending_df = spending_df_tmp
spending_df

    110年生活費  110年娛樂費  110年交通費  110年住宿費
一月     8000     3000     1000     8000
二月     7000     5000     1200     8000
三月     7500     4000     1200     8000

In [14]:
#查詢欄資料
spending_df['110年交通費']

一月    1000
二月    1200
三月    1200
Name: 110年交通費, dtype: int64

In [15]:
#查詢列資料
spending_df.loc['一月']

110年生活費    8000
110年娛樂費    3000
110年交通費    1000
110年住宿費    8000
Name: 一月, dtype: int64

In [16]:
#查詢單一值
spending_df['110年交通費']['一月']

1000

In [17]:
#無視欄名稱和列index，查詢欄資料
spending_df.iloc[:,2]

一月    1000
二月    1200
三月    1200
Name: 110年交通費, dtype: int64

In [18]:
#無視欄名稱和列index，查詢列資料
spending_df.iloc[0,:]

110年生活費    8000
110年娛樂費    3000
110年交通費    1000
110年住宿費    8000
Name: 一月, dtype: int64

In [19]:
#無視欄名稱和列index，查詢單一值
spending_df.iloc[0,2]

1000

In [21]:
#宣告一個新的df
earning_df = pd.DataFrame({
        '110年薪資收入':[21000, 21000, 22000],
        '110年股票收入':[1000, 0 ,200]
        })
earning_df

   110年薪資收入  110年股票收入
0     21000      1000
1     21000         0
2     22000       200

In [29]:
#宣告一個新的df
spending45_df = pd.DataFrame({
        '110年生活費':[9000, 8000],
        '110年娛樂費':[5000, 1200],
        '110年交通費':[1000, 0],
        '110年住宿費':[8000, 8000]
        })
spending45_df

   110年生活費  110年娛樂費  110年交通費  110年住宿費
0     9000     5000     1000     8000
1     8000     1200        0     8000

In [22]:
#合併兩個df，合併方向為axis=1
property_df = pd.concat([spending_df,earning_df],axis=1)
property_df

    110年生活費  110年娛樂費  110年交通費  110年住宿費  110年薪資收入  110年股票收入
0       NaN      NaN      NaN      NaN   21000.0    1000.0
1       NaN      NaN      NaN      NaN   21000.0       0.0
2       NaN      NaN      NaN      NaN   22000.0     200.0
一月   8000.0   3000.0   1000.0   8000.0       NaN       NaN
三月   7500.0   4000.0   1200.0   8000.0       NaN       NaN
二月   7000.0   5000.0   1200.0   8000.0       NaN       NaN

In [30]:
#合併兩個df，合併方向為axis=0
property_df = pd.concat([spending_df,spending45_df],axis=0)
property_df

    110年生活費  110年娛樂費  110年交通費  110年住宿費
一月     8000     3000     1000     8000
二月     7000     5000     1200     8000
三月     7500     4000     1200     8000
0      9000     5000     1000     8000
1      8000     1200        0     8000

In [31]:
#合併兩個df，合併方向為axis=0，忽略兩個df的index
property_df = pd.concat([spending_df,spending45_df],axis=0, ignore_index=True)
property_df

   110年生活費  110年娛樂費  110年交通費  110年住宿費
0     8000     3000     1000     8000
1     7000     5000     1200     8000
2     7500     4000     1200     8000
3     9000     5000     1000     8000
4     8000     1200        0     8000

In [10]:
#使用遮罩(mask)查詢
mask1 = spending_df['110年生活費'] == 7000
spending_df[mask1]

    110年生活費  110年娛樂費  110年交通費  110年住宿費
二月     7000     5000     1200     8000

In [9]:
#使用遮罩(mask)查詢
mask2 = spending_df['110年交通費'] > 1000
spending_df[mask2]

    110年生活費  110年娛樂費  110年交通費  110年住宿費
二月     7000     5000     1200     8000
三月     7500     4000     1200     8000

In [11]:
#使用遮罩(mask)查詢，包含兩個條件，需兩個條件都成立
#方法一
spending_df[(mask1 & mask2)]

    110年生活費  110年娛樂費  110年交通費  110年住宿費
二月     7000     5000     1200     8000

In [12]:
#使用遮罩(mask)查詢，包含兩個條件，需兩個條件都成立
#方法二
spending_df[(spending_df['110年生活費'] == 7000) & (spending_df['110年交通費'] > 1000)]

    110年生活費  110年娛樂費  110年交通費  110年住宿費
二月     7000     5000     1200     8000

In [13]:
#使用遮罩(mask)查詢，包含兩個條件，有其中一個條件真則判斷為真
spending_df[(mask1 | mask2)]

    110年生活費  110年娛樂費  110年交通費  110年住宿費
二月     7000     5000     1200     8000
三月     7500     4000     1200     8000